
#+TITLE: blogs
#+DATE: 2018-05-02 Wednesday 11:30:10 -0400
#+AUTHOR: Byron Sanchez
#+EMAIL: byron@hackbytes.io
#+LANGUAGE:  en
#+DESCRIPTION: Monorepo for all of the blogs I write
#+KEYWORDS: BLOGS HACKBYTES PROJECTS
#+FILETAGS: BLOGS HACKBYTES PROJECTS

#+OPTIONS:   H:3 num:t   toc:3 \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:nil
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   author:t creator:t timestamp:t email:t
#+SEQ_TODO: OPEN CLOSED FIXED DEFERRED
#+INFOJS_OPT: view:nil toc:t ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

** OPEN Clean up assets in build/ for nitlite.io
:PROPERTIES:
:ID:       9763cfaa-8594-43b3-8b10-3ae7a9c6b899
:END:
  :LOGBOOK:
  CLOCK: [2017-08-03 Thu 20:42]--[2017-08-03 Thu 20:43] =>  0:01
  :END:
[2017-08-03 Thu 20:42]
[[file:~/Dropbox/byronsanchez/nitelite.io/contents/org/nitelite.io.org::*Intro][Intro]]
** OPEN Consider using custom ids for blog publishing
:PROPERTIES:
:ID:       8a3c4fc5-d94b-41d9-b113-a751eb242050
:END:
  :LOGBOOK:
  CLOCK: [2017-07-31 Mon 15:54]--[2017-07-31 Mon 15:55] =>  0:01
  :END:
[2017-07-31 Mon 15:54]
[[file:~/.dotfiles/emacs/.emacs.d.symlink/config.org::*org-export%20blogs][org-export blogs]]

https://writequit.org/articles/emacs-org-mode-generate-ids.html
** FIXED Decide on "live in emacs" or "live in fossil" for repo projects
CLOSED: [2018-03-19 Mon 00:57]
:PROPERTIES:
:ID:       b7e3782f-c0ca-4624-9ac6-7c39dee4490f
:END:
:LOGBOOK:
- State "DONE"       from "HOLD"       [2018-03-19 Mon 00:57]
- State "HOLD"       from "TODO"       [2018-02-18 Sun 14:05] \\
  Waiting to see how my project management develops over long spans of time (eg.
  music production project tasks and notes, blog project tasks and notes, and any
  other projects I pursue and track using org-mode).

  This will give me more data on how I should efficiently track my individual
  projects.
CLOCK: [2018-02-18 Sun 14:04]--[2018-02-18 Sun 14:06] =>  0:02
:END:
[2018-02-18 Sun 14:04]
[[file:x:/notebook/blogs/hackbytes.org]]

Mainly because it seems I'm moving everythign to org files, at least for some
projects (blogs). Like docs, and tasks are best managed by org-mode for my blog
projects.

Perhaps the same will be true for music production and other software projects I
have.

[2018-03-19 Mon 00:53]

Decided to live in the project systems (fossil, ticketing, etc.) since it's more
potential to open for collabs and scaling.

I will "check out" tasks and stuff into org-mode, but the authoritative source
will be in the project repo- fossil, git issue tracker, whatever it is.

Maybe I'll adopt the same policy for Salesforce...

I don't own the data with that, so I'm more hesitant, but I'll think about it.
Maybe if I get comfortable with managing exported data.
*** DONE Fix hackbytes.com and nitelite.io contact forms from sql to mail or something like that
  CLOSED: [2018-04-12 Thu 13:34] SCHEDULED: <2018-03-11 Sun>
  :PROPERTIES:
  :ID:       12c16e6d-ccf7-4e75-89e3-561faa080e1a
  :END:
  :LOGBOOK:
  CLOCK: [2018-03-05 Mon 11:41]--[2018-03-05 Mon 11:42] =>  0:01
  :END:
[2018-03-05 Mon 11:41]
[[file:~/Dropbox/hackBytes/ringcentral-web-widget-demos/docs/salesforce_lightning_more/code/RCPhone.vfp::})%3B][file:~/Dropbox/hackBytes/ringcentral-web-widget-demos/docs/salesforce_lightning_more/code/RCPhone.vfp::});]]
*** My Decision for Using Wintersmith as a Static-Site Generator     :NOTE:
    :PROPERTIES:
    :ID:       146abc38-7824-437a-ab6a-ef56bb948a04
    :END:
    :LOGBOOK:
    CLOCK: [2018-04-16 Mon 12:10]--[2018-04-16 Mon 12:11] =>  0:01
    :END:
  [2018-04-16 Mon 12:10]
  [[id:e7137777-ac88-41ae-bc3f-1a0688e613d8][Stack]]

  wintersmith decision

  restore backup of blogs, revert wintersmith to non-edited checkpoint, and just
  leverage import paths for coffee and sass files, and see if you can do the same
  with templates (eg. layout: ../blogs-universal/src/contents/templates) etc.

  manage it like that.

  to really go in deep with wintersmith, I have to learn the entire architecture.
  everything is tied together:

  - async ops
  - relative and full file paths relative to contents directory
  - plugin loading, template loading, content output files, etc.

  and im not sure that's a wise move given alternative solutions like react based
  ones, and even perhaps just moving to straight org mode with reference
  templating as front end assets, but moving compile-time steps to org-mode.

  basically, it's not a quick hack fix, it's a small architecture rewrite to get
  wintersmith to do what i want to do.

  So I'd rather just work with it as it exists now, and evaluate alternative
  solutions if it becomes to much of a bottleneck, and only then decide on
  wintersmith small rewrite, vs. org-mode migration vs. alternative static site
  generator that does what I need it to if it exists. (and if it doesn't, I'll
  have to weigh the options of cost of migration + cost of rewrite and whether
  it'll be trivial or non-trivial, etc. I think org-mode migration is the most
  viable long-term solution however, since other than jekyll, most generators seem
  to come and go).
